const express = require('express');

const router = express.Router();

const tweets = {
  tweets: [
    {
      text:
        `
        دوستم این ترم برنامه نویسی داره بعد میگه خیلی سخته و این داستانا
        بش میگم چه زبونی تدریس میکنن؟
        میگه انگلیسی :)
        `,
      numberOfHashtags: 0,
    },
    {
      text:
        `
        دوستان برنامه نویس کسی مشاور حرفه ای مهاجرت میشناسه؟
        فک کن برای خانواده خودت میخوای.
        #برنامه_نویسی
        #برنامه_نویس
        `,
      numberOfHashtags: 2,
    },
    {
      text:
        `
        #نصب انواع #پکیج در #لاراول با استفاده از #کامپوزر
        `,
      numberOfHashtags: 4,
    },
    {
      text:
        `
        تفاوت برنامه نویس frontend# و #Backend
         #programming
        `,
      numberOfHashtags: 3,
    },
    {
      text:
        `
        اقا بعد از نصب آرچ و ریبوت این اتفاق افتاد برام.  چیکارش کنم اینو؟
        دوستان #برنامه_نویس و #لینوکس_باز کمکم کنین.
        `,
      numberOfHashtags: 2,
    },
    {
      text:
        `
        ای من ریدم به این ربات #برنامه_نویسی
        `,
      numberOfHashtags: 1,
    },
    {
      text:
        `
        هیچکدوم در دسته برنامه نویسا نیستن
        سینگل کوت برای کاراکتره
        دابل کوت برای رشته
        #javascript sucks...
        #PHP sucks...
        #csharp rules..
        `,
      numberOfHashtags: 3,
    },
    {
      text:
        `
        حالا که بحث حقوق #برنامه_نویس ها توی اونور آب ترند شده ، بذارید من هم میزان حقوق برنامه نویسها بر اساس زبان برنامه نویسی در سال ۲۰۲۰ بذارم.
        `,
      numberOfHashtags: 1,
    },
    {
      text:
        `
        بچه‌ها، برنامه‌نویس جونیور/سینیور پایتون و جنگو می‌خوایم :)))
        اگر مایل هستید برام رزومه بفرستید
        #ریتوئیت #بازارکار
        `,
      numberOfHashtags: 2,
    },
    {
      text:
        `
        چ خوبه متغیر از نوع خودت بتونی تعریف کنی :)

        #typealias #kotlin
        `,
      numberOfHashtags: 2,
    },
    {
      text:
        `
        دوستان این لایو #برنامه_نویسی رو از دست ندید، علی راحمی از آلمان که توی حوزه برنامه نویسی فعالیت میکنه با رامین زارع از دانمارک @zare88r که من هم ویدیوهای #جاوا ش رو باهاتون به اشتراک میگذارم فردا ۲۱ آذر ساعت ۹ به وقت تهران یه لایو برنامه نویسی دارن.
        اینستا:
        @codingwithramin
        `,
      numberOfHashtags: 2,
    },
    {
      text:
        `
        طرف می‌خواد نوشته کاوی(text mining) کنه به من می‌گه خروجی بعد از فراخوانی رو بریز توی mysql ⁦(╯°□°）╯︵ ┻━┻⁩
        `,
      numberOfHashtags: 0,
    },
    {
      text:
        `
        چه سعادتی شد :)

        #گیت_هاب
        #برنامه_نویسی
        `,
      numberOfHashtags: 2,
    },
    {
      text:
        `
        همین امروز رایگان کیفیت را تجربه کنید

        #وردپرس
        #لینوکس
        #وبسایت
        #هاستینگ
        #سرورمجازی
        #wordpress
        #website
        #linux
        `,
      numberOfHashtags: 8,
    },
    {
      text:
        `
        #محسن_طاوسی:
         اگر سینگل پیج اپلیکیشن‌ها، per render نداشته باشن، دچار مشکلات نرخ کرال و رندرینگ میشن.
        #سئو
        #برنامه_نویسی
        #کندوپلاس
        `,
      numberOfHashtags: 4,
    },
    {
      text:
        `
        نرم‌افزار #phpstorm همون فتوشاپ php کارهاست.
        #php #laravel #yii #لاراول #وردپرس
        `,
      numberOfHashtags: 6,
    },
  ],
};

router.get('/tweets', async (req, res) => {
  res.json(tweets);
});

module.exports = router;
